# Погружение в Python (семинары)
# Урок 11. ООП. Особенности Python

# Создайте класс Матрица. Добавьте методы для:
# вывода на печать,
# сравнения,
# сложения,
# *умножения матриц


import my_utils5 as mu5

if __name__ == '__main__':
    # print('--== Тестирование класса MyString ==--')
    # my_string = mu4.MyString('Привет!', 'Марк Лутц')
    # print(f'{my_string=}')
    # print(f'{my_string.author=}')
    # print(f'{my_string.date_time=}')
    # print(f'{my_string.lower()=}')

    pass
